; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	spectrograph0 - mode
	thermograph3 - mode
	spectrograph1 - mode
	thermograph4 - mode
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star4 - direction
	Star3 - direction
	Star6 - direction
	Star0 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star6)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
)
(:goal (and
	(pointing satellite1 Planet10)
	(have_image Star7 thermograph3)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 thermograph4)
	(have_image Planet10 spectrograph1)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 thermograph4)
	(have_image Star13 thermograph4)
	(have_image Star14 thermograph4)
	(have_image Phenomenon15 thermograph3)
))

)

; plan
1. (turn_to satellite2 star3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star3)
   goals met: 0 of 10
2. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   goals met: 0 of 10
3. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 0 of 10
4. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 10
5. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 10
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
7. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 10
8. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 10
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 10
10. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 0 of 10
11. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 10
12. (turn_to satellite1 phenomenon15 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 10
13. (take_image satellite1 phenomenon15 instrument1 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 2 of 10
14. (turn_to satellite1 star7 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star7)
   goals met: 2 of 10
15. (take_image satellite1 star7 instrument1 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 3 of 10
16. (turn_to satellite1 planet10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet10)
   goals met: 4 of 10
17. (turn_to satellite2 phenomenon12 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 10
18. (take_image satellite2 phenomenon12 instrument4 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 5 of 10
19. (turn_to satellite2 phenomenon9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon9)
   goals met: 5 of 10
20. (take_image satellite2 phenomenon9 instrument4 thermograph4)
   added: (have_image phenomenon9 thermograph4)
   goals met: 6 of 10
21. (turn_to satellite2 star13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star13)
   goals met: 6 of 10
22. (take_image satellite2 star13 instrument4 thermograph4)
   added: (have_image star13 thermograph4)
   goals met: 7 of 10
23. (turn_to satellite2 star14 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star14)
   goals met: 7 of 10
24. (take_image satellite2 star14 instrument4 thermograph4)
   added: (have_image star14 thermograph4)
   goals met: 8 of 10
25. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 8 of 10
26. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 8 of 10
27. (turn_to satellite2 star0 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star0)
   goals met: 8 of 10
28. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 8 of 10
29. (turn_to satellite2 planet10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet10)
   goals met: 8 of 10
30. (take_image satellite2 planet10 instrument5 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 9 of 10
31. (turn_to satellite2 star11 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star11)
   goals met: 9 of 10
32. (take_image satellite2 star11 instrument5 infrared2)
   added: (have_image star11 infrared2)
   goals met: 10 of 10
